razortail-qzxvk/based-on-stm32mp257fak3/STM32CubeMX/CM33/refactoring/startup_stm32mp257fakx.S
/**
 * 改动列表:
 * - .fpu softvfp -> .fpu fpv5-sp-d16
 */

.syntax unified
.cpu cortex-m33
.fpu fpv5-sp-d16
.thumb

.global g_pfnVectors
.global Default_Handler

.section .text.Reset_Handler
.weak Reset_Handler
.type Reset_Handler, %function
  Reset_Handler:
    ldr  sp, =_estack
    bl   SystemInit

    ldr  r0, =_sdata
    ldr  r1, =_edata
    ldr  r2, =_sidata
    movs r3, #0
    b    LoopCopyDataInit

CopyDataInit:
    ldr  r4, [r2, r3]
    str  r4, [r0, r3]
    adds r3, r3, #4

LoopCopyDataInit:
    adds r4, r0, r3
    cmp  r4, r1
    bcc  CopyDataInit

    ldr  r2, =_sbss
    b    LoopFillZerobss

FillZerobss:
    movs r3, #0
    str  r3, [r2], #4

LoopFillZerobss:
    ldr  r3, = _ebss
    cmp  r2, r3
    bcc  FillZerobss

    bl   __libc_init_array

    bl   main

LoopForever:
    b LoopForever

.size Reset_Handler, .-Reset_Handler

.section .text.Default_Handler, "ax", %progbits
Default_Handler:
Infinite_Loop:
    b    Infinite_Loop
.size Default_Handler, .-Default_Handler


.section .isr_vectors,"a",%progbits
.type g_pfnVectors, %object

.globl __Vectors
__Vectors:
g_pfnVectors:
    .word   _estack
    .word   Reset_Handler
    .word   NMI_Handler
    .word   HardFault_Handler
    .word   MemManage_Handler
    .word   BusFault_Handler
    .word   UsageFault_Handler
    .word   SecureFault_Handler
    .word   0
    .word   0
    .word   0
    .word   SVC_Handler
    .word   DebugMon_Handler
    .word   0
    .word   PendSV_Handler
    .word   SysTick_Handler
    .word   PVD_IRQHandler
    .word   PVM_IRQHandler
    .word   IWDG3_IRQHandler
    .word   IWDG4_IRQHandler
    .word   IWDG1_RST_IRQHandler
    .word   IWDG2_RST_IRQHandler
    .word   IWDG4_RST_IRQHandler
    .word   IWDG5_RST_IRQHandler
    .word   WWDG1_IRQHandler
    .word   RESERVED_9_IRQHandler
    .word   0
    .word   WWDG2_RST_IRQHandler
    .word   TAMP_IRQHandler
    .word   RTC_IRQHandler
    .word   TAMP_S_IRQHandler
    .word   RTC_S_IRQHandler
    .word   RCC_IRQHandler
    .word   EXTI2_0_IRQHandler
    .word   EXTI2_1_IRQHandler
    .word   EXTI2_2_IRQHandler
    .word   EXTI2_3_IRQHandler
    .word   EXTI2_4_IRQHandler
    .word   EXTI2_5_IRQHandler
    .word   EXTI2_6_IRQHandler
    .word   EXTI2_7_IRQHandler
    .word   EXTI2_8_IRQHandler
    .word   EXTI2_9_IRQHandler
    .word   EXTI2_10_IRQHandler
    .word   EXTI2_11_IRQHandler
    .word   EXTI2_12_IRQHandler
    .word   EXTI2_13_IRQHandler
    .word   EXTI2_14_IRQHandler
    .word   EXTI2_15_IRQHandler
    .word   HPDMA1_Channel0_IRQHandler
    .word   HPDMA1_Channel1_IRQHandler
    .word   HPDMA1_Channel2_IRQHandler
    .word   HPDMA1_Channel3_IRQHandler
    .word   HPDMA1_Channel4_IRQHandler
    .word   HPDMA1_Channel5_IRQHandler
    .word   HPDMA1_Channel6_IRQHandler
    .word   HPDMA1_Channel7_IRQHandler
    .word   HPDMA1_Channel8_IRQHandler
    .word   HPDMA1_Channel9_IRQHandler
    .word   HPDMA1_Channel10_IRQHandler
    .word   HPDMA1_Channel11_IRQHandler
    .word   HPDMA1_Channel12_IRQHandler
    .word   HPDMA1_Channel13_IRQHandler
    .word   HPDMA1_Channel14_IRQHandler
    .word   HPDMA1_Channel15_IRQHandler
    .word   HPDMA2_Channel0_IRQHandler
    .word   HPDMA2_Channel1_IRQHandler
    .word   HPDMA2_Channel2_IRQHandler
    .word   HPDMA2_Channel3_IRQHandler
    .word   HPDMA2_Channel4_IRQHandler
    .word   HPDMA2_Channel5_IRQHandler
    .word   HPDMA2_Channel6_IRQHandler
    .word   HPDMA2_Channel7_IRQHandler
    .word   HPDMA2_Channel8_IRQHandler
    .word   HPDMA2_Channel9_IRQHandler
    .word   HPDMA2_Channel10_IRQHandler
    .word   HPDMA2_Channel11_IRQHandler
    .word   HPDMA2_Channel12_IRQHandler
    .word   HPDMA2_Channel13_IRQHandler
    .word   HPDMA2_Channel14_IRQHandler
    .word   HPDMA2_Channel15_IRQHandler
    .word   HPDMA3_Channel0_IRQHandler
    .word   HPDMA3_Channel1_IRQHandler
    .word   HPDMA3_Channel2_IRQHandler
    .word   HPDMA3_Channel3_IRQHandler
    .word   HPDMA3_Channel4_IRQHandler
    .word   HPDMA3_Channel5_IRQHandler
    .word   HPDMA3_Channel6_IRQHandler
    .word   HPDMA3_Channel7_IRQHandler
    .word   HPDMA3_Channel8_IRQHandler
    .word   HPDMA3_Channel9_IRQHandler
    .word   HPDMA3_Channel10_IRQHandler
    .word   HPDMA3_Channel11_IRQHandler
    .word   HPDMA3_Channel12_IRQHandler
    .word   HPDMA3_Channel13_IRQHandler
    .word   HPDMA3_Channel14_IRQHandler
    .word   HPDMA3_Channel15_IRQHandler
    .word   LPDMA_Channel0_IRQHandler
    .word   LPDMA_Channel1_IRQHandler
    .word   LPDMA_Channel2_IRQHandler
    .word   LPDMA_Channel3_IRQHandler
    .word   ICACHE_IRQHandler
    .word   DCACHE_IRQHandler
    .word   ADC1_IRQHandler
    .word   ADC2_IRQHandler
    .word   ADC3_IRQHandler
    .word   FDCAN_CAL_IRQHandler
    .word   FDCAN1_IT0_IRQHandler
    .word   FDCAN2_IT0_IRQHandler
    .word   FDCAN3_IT0_IRQHandler
    .word   FDCAN1_IT1_IRQHandler
    .word   FDCAN2_IT1_IRQHandler
    .word   FDCAN3_IT1_IRQHandler
    .word   TIM1_BRK_IRQHandler
    .word   TIM1_UP_IRQHandler
    .word   TIM1_TRG_COM_IRQHandler
    .word   TIM1_CC_IRQHandler
    .word   TIM20_BRK_IRQHandler
    .word   TIM20_UP_IRQHandler
    .word   TIM20_TRG_COM_IRQHandler
    .word   TIM20_CC_IRQHandler
    .word   TIM2_IRQHandler
    .word   TIM3_IRQHandler
    .word   TIM4_IRQHandler
    .word   I2C1_IRQHandler
    .word   I3C1_IRQHandler
    .word   I2C2_IRQHandler
    .word   I3C2_IRQHandler
    .word   SPI1_IRQHandler
    .word   SPI2_IRQHandler
    .word   USART1_IRQHandler
    .word   USART2_IRQHandler
    .word   USART3_IRQHandler
    .word   VDEC_IRQHandler
    .word   TIM8_BRK_IRQHandler
    .word   TIM8_UP_IRQHandler
    .word   TIM8_TRG_COM_IRQHandler
    .word   TIM8_CC_IRQHandler
    .word   FMC_IRQHandler
    .word   SDMMC1_IRQHandler
    .word   TIM5_IRQHandler
    .word   SPI3_IRQHandler
    .word   UART4_IRQHandler
    .word   UART5_IRQHandler
    .word   TIM6_IRQHandler
    .word   TIM7_IRQHandler
    .word   ETH1_SBD_IRQHandler
    .word   ETH1_PMT_IRQHandler
    .word   ETH1_LPI_IRQHandler
    .word   ETH2_SBD_IRQHandler
    .word   ETH2_PMT_IRQHandler
    .word   ETH2_LPI_IRQHandler
    .word   USART6_IRQHandler
    .word   I2C3_IRQHandler
    .word   I3C3_IRQHandler
    .word   USBH_EHCI_IRQHandler
    .word   USBH_OHCI_IRQHandler
    .word   DCMI_PSSI_IRQHandler
    .word   CSI_IRQHandler
    .word   DSI_IRQHandler
    .word   CRYP1_IRQHandler
    .word   HASH_IRQHandler
    .word   PKA_IRQHandler
    .word   FPU_IRQHandler
    .word   UART7_IRQHandler
    .word   UART8_IRQHandler
    .word   UART9_IRQHandler
    .word   LPUART1_IRQHandler
    .word   SPI4_IRQHandler
    .word   SPI5_IRQHandler
    .word   SPI6_IRQHandler
    .word   SPI7_IRQHandler
    .word   SPI8_IRQHandler
    .word   SAI1_IRQHandler
    .word   LTDC_IRQHandler
    .word   LTDC_ER_IRQHandler
    .word   LTDC_SEC_IRQHandler
    .word   LTDC_SEC_ER_IRQHandler
    .word   SAI2_IRQHandler
    .word   OCTOSPI1_IRQHandler
    .word   OCTOSPI2_IRQHandler
    .word   OTFDEC1_IRQHandler
    .word   LPTIM1_IRQHandler
    .word   VENC_IRQHandler
    .word   I2C4_IRQHandler
    .word   USBH_WAKEUP_IRQHandler
    .word   SPDIFRX_IRQHandler
    .word   IPCC1_RX_IRQHandler
    .word   IPCC1_TX_IRQHandler
    .word   IPCC1_RX_S_IRQHandler
    .word   IPCC1_TX_S_IRQHandler
    .word   IPCC2_RX_IRQHandler
    .word   IPCC2_TX_IRQHandler
    .word   IPCC2_RX_S_IRQHandler
    .word   IPCC2_TX_S_IRQHandler
    .word   SAES_IRQHandler
    .word   CRYP2_IRQHandler
    .word   I2C5_IRQHandler
    .word   USB3DR_WAKEUP_IRQHandler
    .word   GPU_IRQHandler
    .word   MDF1_FLT0_IRQHandler
    .word   MDF1_FLT1_IRQHandler
    .word   MDF1_FLT2_IRQHandler
    .word   MDF1_FLT3_IRQHandler
    .word   MDF1_FLT4_IRQHandler
    .word   MDF1_FLT5_IRQHandler
    .word   MDF1_FLT6_IRQHandler
    .word   MDF1_FLT7_IRQHandler
    .word   SAI3_IRQHandler
    .word   TIM15_IRQHandler
    .word   TIM16_IRQHandler
    .word   TIM17_IRQHandler
    .word   TIM12_IRQHandler
    .word   SDMMC2_IRQHandler
    .word   DCMIPP_IRQHandler
    .word   HSEM_IRQHandler
    .word   HSEM_S_IRQHandler
    .word   nCTIIRQ1_IRQHandler
    .word   nCTIIRQ2_IRQHandler
    .word   TIM13_IRQHandler
    .word   TIM14_IRQHandler
    .word   TIM10_IRQHandler
    .word   RNG_IRQHandler
    .word   ADF1_FLT_IRQHandler
    .word   I2C6_IRQHandler
    .word   COMBOPHY_WAKEUP_IRQHandler
    .word   I2C7_IRQHandler
    .word   0
    .word   I2C8_IRQHandler
    .word   I3C4_IRQHandler
    .word   SDMMC3_IRQHandler
    .word   LPTIM2_IRQHandler
    .word   LPTIM3_IRQHandler
    .word   LPTIM4_IRQHandler
    .word   LPTIM5_IRQHandler
    .word   OTFDEC2_IRQHandler
    .word   CPU1_SEV_IRQHandler
    .word   CPU3_SEV_IRQHandler
    .word   RCC_WAKEUP_IRQHandler
    .word   SAI4_IRQHandler
    .word   DTS_IRQHandler
    .word   TIM11_IRQHandler
    .word   CPU2_WAKEUP_PIN_IRQHandler
    .word   USB3DR_BC_IRQHandler
    .word   USB3DR_IRQHandler
    .word   UCPD1_IRQHandler
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   SERF_IRQHandler
    .word   BUSPERFM_IRQHandler
    .word   RAMCFG_IRQHandler
    .word   DDRCTRL_IRQHandler
    .word   DDRPHYC_IRQHandler
    .word   DFI_ERR_IRQHandler
    .word   IAC_IRQHandler
    .word   VDDCPU_VD_IRQHandler
    .word   VDDCORE_VD_IRQHandler
    .word   0
    .word   ETHSW_IRQHandler
    .word   ETHSW_MSGBUF_IRQHandler
    .word   ETHSW_FSC_IRQHandler
    .word   HPDMA1_WKUP_IRQHandler
    .word   HPDMA2_WKUP_IRQHandler
    .word   HPDMA3_WKUP_IRQHandler
    .word   LPDMA_WKUP_IRQHandler
    .word   UCPD1_VBUS_IRQHandler
    .word   UCPD1_VSAFE5V_IRQHandler
    .word   RCC_HSI_FMON_IRQHandler
    .word   VDDGPU_VD_IRQHandler
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   EXTI1_0_IRQHandler
    .word   EXTI1_1_IRQHandler
    .word   EXTI1_2_IRQHandler
    .word   EXTI1_3_IRQHandler
    .word   EXTI1_4_IRQHandler
    .word   EXTI1_5_IRQHandler
    .word   EXTI1_6_IRQHandler
    .word   EXTI1_7_IRQHandler
    .word   EXTI1_8_IRQHandler
    .word   EXTI1_9_IRQHandler
    .word   EXTI1_10_IRQHandler
    .word   EXTI1_11_IRQHandler
    .word   EXTI1_12_IRQHandler
    .word   EXTI1_13_IRQHandler
    .word   EXTI1_14_IRQHandler
    .word   EXTI1_15_IRQHandler
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   IS2M_IRQHandler
    .word   0
    .word   DDRPERFM_IRQHandler
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
    .word   0
.size g_pfnVectors, .-g_pfnVectors

.macro def_irq_handler handler_name
.weak \handler_name
.thumb_set \handler_name, Default_Handler
.endm
    def_irq_handler NMI_Handler
    def_irq_handler HardFault_Handler
    def_irq_handler MemManage_Handler
    def_irq_handler BusFault_Handler
    def_irq_handler UsageFault_Handler
    def_irq_handler SecureFault_Handler
    def_irq_handler SVC_Handler
    def_irq_handler DebugMon_Handler
    def_irq_handler PendSV_Handler
    def_irq_handler SysTick_Handler

    def_irq_handler PVD_IRQHandler
    def_irq_handler PVM_IRQHandler
    def_irq_handler IWDG3_IRQHandler
    def_irq_handler IWDG4_IRQHandler
    def_irq_handler IWDG1_RST_IRQHandler
    def_irq_handler IWDG2_RST_IRQHandler
    def_irq_handler IWDG4_RST_IRQHandler
    def_irq_handler IWDG5_RST_IRQHandler
    def_irq_handler WWDG1_IRQHandler
    def_irq_handler WWDG2_RST_IRQHandler
    def_irq_handler TAMP_IRQHandler
    def_irq_handler RTC_IRQHandler
    def_irq_handler TAMP_S_IRQHandler
    def_irq_handler RTC_S_IRQHandler
    def_irq_handler RCC_IRQHandler
    def_irq_handler EXTI2_0_IRQHandler
    def_irq_handler EXTI2_1_IRQHandler
    def_irq_handler EXTI2_2_IRQHandler
    def_irq_handler EXTI2_3_IRQHandler
    def_irq_handler EXTI2_4_IRQHandler
    def_irq_handler EXTI2_5_IRQHandler
    def_irq_handler EXTI2_6_IRQHandler
    def_irq_handler EXTI2_7_IRQHandler
    def_irq_handler EXTI2_8_IRQHandler
    def_irq_handler EXTI2_9_IRQHandler
    def_irq_handler EXTI2_10_IRQHandler
    def_irq_handler EXTI2_11_IRQHandler
    def_irq_handler EXTI2_12_IRQHandler
    def_irq_handler EXTI2_13_IRQHandler
    def_irq_handler EXTI2_14_IRQHandler
    def_irq_handler EXTI2_15_IRQHandler
    def_irq_handler HPDMA1_Channel0_IRQHandler
    def_irq_handler HPDMA1_Channel1_IRQHandler
    def_irq_handler HPDMA1_Channel2_IRQHandler
    def_irq_handler HPDMA1_Channel3_IRQHandler
    def_irq_handler HPDMA1_Channel4_IRQHandler
    def_irq_handler HPDMA1_Channel5_IRQHandler
    def_irq_handler HPDMA1_Channel6_IRQHandler
    def_irq_handler HPDMA1_Channel7_IRQHandler
    def_irq_handler HPDMA1_Channel8_IRQHandler
    def_irq_handler HPDMA1_Channel9_IRQHandler
    def_irq_handler HPDMA1_Channel10_IRQHandler
    def_irq_handler HPDMA1_Channel11_IRQHandler
    def_irq_handler HPDMA1_Channel12_IRQHandler
    def_irq_handler HPDMA1_Channel13_IRQHandler
    def_irq_handler HPDMA1_Channel14_IRQHandler
    def_irq_handler HPDMA1_Channel15_IRQHandler
    def_irq_handler HPDMA2_Channel0_IRQHandler
    def_irq_handler HPDMA2_Channel1_IRQHandler
    def_irq_handler HPDMA2_Channel2_IRQHandler
    def_irq_handler HPDMA2_Channel3_IRQHandler
    def_irq_handler HPDMA2_Channel4_IRQHandler
    def_irq_handler HPDMA2_Channel5_IRQHandler
    def_irq_handler HPDMA2_Channel6_IRQHandler
    def_irq_handler HPDMA2_Channel7_IRQHandler
    def_irq_handler HPDMA2_Channel8_IRQHandler
    def_irq_handler HPDMA2_Channel9_IRQHandler
    def_irq_handler HPDMA2_Channel10_IRQHandler
    def_irq_handler HPDMA2_Channel11_IRQHandler
    def_irq_handler HPDMA2_Channel12_IRQHandler
    def_irq_handler HPDMA2_Channel13_IRQHandler
    def_irq_handler HPDMA2_Channel14_IRQHandler
    def_irq_handler HPDMA2_Channel15_IRQHandler
    def_irq_handler HPDMA3_Channel0_IRQHandler
    def_irq_handler HPDMA3_Channel1_IRQHandler
    def_irq_handler HPDMA3_Channel2_IRQHandler
    def_irq_handler HPDMA3_Channel3_IRQHandler
    def_irq_handler HPDMA3_Channel4_IRQHandler
    def_irq_handler HPDMA3_Channel5_IRQHandler
    def_irq_handler HPDMA3_Channel6_IRQHandler
    def_irq_handler HPDMA3_Channel7_IRQHandler
    def_irq_handler HPDMA3_Channel8_IRQHandler
    def_irq_handler HPDMA3_Channel9_IRQHandler
    def_irq_handler HPDMA3_Channel10_IRQHandler
    def_irq_handler HPDMA3_Channel11_IRQHandler
    def_irq_handler HPDMA3_Channel12_IRQHandler
    def_irq_handler HPDMA3_Channel13_IRQHandler
    def_irq_handler HPDMA3_Channel14_IRQHandler
    def_irq_handler HPDMA3_Channel15_IRQHandler
    def_irq_handler LPDMA_Channel0_IRQHandler
    def_irq_handler LPDMA_Channel1_IRQHandler
    def_irq_handler LPDMA_Channel2_IRQHandler
    def_irq_handler LPDMA_Channel3_IRQHandler
    def_irq_handler ICACHE_IRQHandler
    def_irq_handler DCACHE_IRQHandler
    def_irq_handler ADC1_IRQHandler
    def_irq_handler ADC2_IRQHandler
    def_irq_handler ADC3_IRQHandler
    def_irq_handler FDCAN_CAL_IRQHandler
    def_irq_handler FDCAN1_IT0_IRQHandler
    def_irq_handler FDCAN2_IT0_IRQHandler
    def_irq_handler FDCAN3_IT0_IRQHandler
    def_irq_handler FDCAN1_IT1_IRQHandler
    def_irq_handler FDCAN2_IT1_IRQHandler
    def_irq_handler FDCAN3_IT1_IRQHandler
    def_irq_handler TIM1_BRK_IRQHandler
    def_irq_handler TIM1_UP_IRQHandler
    def_irq_handler TIM1_TRG_COM_IRQHandler
    def_irq_handler TIM1_CC_IRQHandler
    def_irq_handler TIM20_BRK_IRQHandler
    def_irq_handler TIM20_UP_IRQHandler
    def_irq_handler TIM20_TRG_COM_IRQHandler
    def_irq_handler TIM20_CC_IRQHandler
    def_irq_handler TIM2_IRQHandler
    def_irq_handler TIM3_IRQHandler
    def_irq_handler TIM4_IRQHandler
    def_irq_handler I2C1_IRQHandler
    def_irq_handler I3C1_IRQHandler
    def_irq_handler I2C2_IRQHandler
    def_irq_handler I3C2_IRQHandler
    def_irq_handler SPI1_IRQHandler
    def_irq_handler SPI2_IRQHandler
    def_irq_handler USART1_IRQHandler
    def_irq_handler USART2_IRQHandler
    def_irq_handler USART3_IRQHandler
    def_irq_handler VDEC_IRQHandler
    def_irq_handler TIM8_BRK_IRQHandler
    def_irq_handler TIM8_UP_IRQHandler
    def_irq_handler TIM8_TRG_COM_IRQHandler
    def_irq_handler TIM8_CC_IRQHandler
    def_irq_handler FMC_IRQHandler
    def_irq_handler SDMMC1_IRQHandler
    def_irq_handler TIM5_IRQHandler
    def_irq_handler SPI3_IRQHandler
    def_irq_handler UART4_IRQHandler
    def_irq_handler UART5_IRQHandler
    def_irq_handler TIM6_IRQHandler
    def_irq_handler TIM7_IRQHandler
    def_irq_handler ETH1_SBD_IRQHandler
    def_irq_handler ETH1_PMT_IRQHandler
    def_irq_handler ETH1_LPI_IRQHandler
    def_irq_handler ETH2_SBD_IRQHandler
    def_irq_handler ETH2_PMT_IRQHandler
    def_irq_handler ETH2_LPI_IRQHandler
    def_irq_handler USART6_IRQHandler
    def_irq_handler I2C3_IRQHandler
    def_irq_handler I3C3_IRQHandler
    def_irq_handler USBH_EHCI_IRQHandler
    def_irq_handler USBH_OHCI_IRQHandler
    def_irq_handler DCMI_PSSI_IRQHandler
    def_irq_handler CSI_IRQHandler
    def_irq_handler DSI_IRQHandler
    def_irq_handler CRYP1_IRQHandler
    def_irq_handler HASH_IRQHandler
    def_irq_handler PKA_IRQHandler
    def_irq_handler FPU_IRQHandler
    def_irq_handler UART7_IRQHandler
    def_irq_handler UART8_IRQHandler
    def_irq_handler UART9_IRQHandler
    def_irq_handler LPUART1_IRQHandler
    def_irq_handler SPI4_IRQHandler
    def_irq_handler SPI5_IRQHandler
    def_irq_handler SPI6_IRQHandler
    def_irq_handler SPI7_IRQHandler
    def_irq_handler SPI8_IRQHandler
    def_irq_handler SAI1_IRQHandler
    def_irq_handler LTDC_IRQHandler
    def_irq_handler LTDC_ER_IRQHandler
    def_irq_handler LTDC_SEC_IRQHandler
    def_irq_handler LTDC_SEC_ER_IRQHandler
    def_irq_handler SAI2_IRQHandler
    def_irq_handler OCTOSPI1_IRQHandler
    def_irq_handler OCTOSPI2_IRQHandler
    def_irq_handler OTFDEC1_IRQHandler
    def_irq_handler LPTIM1_IRQHandler
    def_irq_handler VENC_IRQHandler
    def_irq_handler I2C4_IRQHandler
    def_irq_handler USBH_WAKEUP_IRQHandler
    def_irq_handler SPDIFRX_IRQHandler
    def_irq_handler IPCC1_RX_IRQHandler
    def_irq_handler IPCC1_TX_IRQHandler
    def_irq_handler IPCC1_RX_S_IRQHandler
    def_irq_handler IPCC1_TX_S_IRQHandler
    def_irq_handler IPCC2_RX_IRQHandler
    def_irq_handler IPCC2_TX_IRQHandler
    def_irq_handler IPCC2_RX_S_IRQHandler
    def_irq_handler IPCC2_TX_S_IRQHandler
    def_irq_handler SAES_IRQHandler
    def_irq_handler CRYP2_IRQHandler
    def_irq_handler I2C5_IRQHandler
    def_irq_handler USB3DR_WAKEUP_IRQHandler
    def_irq_handler GPU_IRQHandler
    def_irq_handler MDF1_FLT0_IRQHandler
    def_irq_handler MDF1_FLT1_IRQHandler
    def_irq_handler MDF1_FLT2_IRQHandler
    def_irq_handler MDF1_FLT3_IRQHandler
    def_irq_handler MDF1_FLT4_IRQHandler
    def_irq_handler MDF1_FLT5_IRQHandler
    def_irq_handler MDF1_FLT6_IRQHandler
    def_irq_handler MDF1_FLT7_IRQHandler
    def_irq_handler SAI3_IRQHandler
    def_irq_handler TIM15_IRQHandler
    def_irq_handler TIM16_IRQHandler
    def_irq_handler TIM17_IRQHandler
    def_irq_handler TIM12_IRQHandler
    def_irq_handler SDMMC2_IRQHandler
    def_irq_handler DCMIPP_IRQHandler
    def_irq_handler HSEM_IRQHandler
    def_irq_handler HSEM_S_IRQHandler
    def_irq_handler nCTIIRQ1_IRQHandler
    def_irq_handler nCTIIRQ2_IRQHandler
    def_irq_handler TIM13_IRQHandler
    def_irq_handler TIM14_IRQHandler
    def_irq_handler TIM10_IRQHandler
    def_irq_handler RNG_IRQHandler
    def_irq_handler ADF1_FLT_IRQHandler
    def_irq_handler I2C6_IRQHandler
    def_irq_handler COMBOPHY_WAKEUP_IRQHandler
    def_irq_handler I2C7_IRQHandler
    def_irq_handler I2C8_IRQHandler
    def_irq_handler I3C4_IRQHandler
    def_irq_handler SDMMC3_IRQHandler
    def_irq_handler LPTIM2_IRQHandler
    def_irq_handler LPTIM3_IRQHandler
    def_irq_handler LPTIM4_IRQHandler
    def_irq_handler LPTIM5_IRQHandler
    def_irq_handler OTFDEC2_IRQHandler
    def_irq_handler CPU1_SEV_IRQHandler
    def_irq_handler CPU3_SEV_IRQHandler
    def_irq_handler RCC_WAKEUP_IRQHandler
    def_irq_handler SAI4_IRQHandler
    def_irq_handler DTS_IRQHandler
    def_irq_handler TIM11_IRQHandler
    def_irq_handler CPU2_WAKEUP_PIN_IRQHandler
    def_irq_handler USB3DR_BC_IRQHandler
    def_irq_handler USB3DR_IRQHandler
    def_irq_handler UCPD1_IRQHandler
    def_irq_handler SERF_IRQHandler
    def_irq_handler BUSPERFM_IRQHandler
    def_irq_handler RAMCFG_IRQHandler
    def_irq_handler DDRCTRL_IRQHandler
    def_irq_handler DDRPHYC_IRQHandler
    def_irq_handler DFI_ERR_IRQHandler
    def_irq_handler IAC_IRQHandler
    def_irq_handler VDDCPU_VD_IRQHandler
    def_irq_handler VDDCORE_VD_IRQHandler
    def_irq_handler ETHSW_IRQHandler
    def_irq_handler ETHSW_MSGBUF_IRQHandler
    def_irq_handler ETHSW_FSC_IRQHandler
    def_irq_handler HPDMA1_WKUP_IRQHandler
    def_irq_handler HPDMA2_WKUP_IRQHandler
    def_irq_handler HPDMA3_WKUP_IRQHandler
    def_irq_handler LPDMA_WKUP_IRQHandler
    def_irq_handler UCPD1_VBUS_IRQHandler
    def_irq_handler UCPD1_VSAFE5V_IRQHandler
    def_irq_handler RCC_HSI_FMON_IRQHandler
    def_irq_handler VDDGPU_VD_IRQHandler
    def_irq_handler EXTI1_0_IRQHandler
    def_irq_handler EXTI1_1_IRQHandler
    def_irq_handler EXTI1_2_IRQHandler
    def_irq_handler EXTI1_3_IRQHandler
    def_irq_handler EXTI1_4_IRQHandler
    def_irq_handler EXTI1_5_IRQHandler
    def_irq_handler EXTI1_6_IRQHandler
    def_irq_handler EXTI1_7_IRQHandler
    def_irq_handler EXTI1_8_IRQHandler
    def_irq_handler EXTI1_9_IRQHandler
    def_irq_handler EXTI1_10_IRQHandler
    def_irq_handler EXTI1_11_IRQHandler
    def_irq_handler EXTI1_12_IRQHandler
    def_irq_handler EXTI1_13_IRQHandler
    def_irq_handler EXTI1_14_IRQHandler
    def_irq_handler EXTI1_15_IRQHandler
    def_irq_handler IS2M_IRQHandler
    def_irq_handler DDRPERFM_IRQHandler
    def_irq_handler RESERVED_9_IRQHandler
